In [1]:
import pandas as pd
import numpy as np
import pymysql

In [2]:
#lecture de la DF
df_movie = pd.read_table('movie.csv', sep=',')
df_movie

,movie,years,imdb,genre,votes,metascore
0,Logan,(2017),8.1,"Action, Drama, Sci-Fi",603294,77
1,Thor: Ragnarok,(2017),7.9,"Action, Adventure, Comedy",536979,74
2,Star Wars: Episode VIII - The Last Jedi,(2017),7.0,"Action, Adventure, Fantasy",527314,85
3,Guardians of the Galaxy Vol. 2,(2017),7.6,"Action, Adventure, Comedy",527257,67
4,Wonder Woman,(2017),7.4,"Action, Adventure, Fantasy",519811,76
...,...,...,...,...,...,...
3916,Outlaw King,(2018),6.9,"Action, Biography, Drama",52776,59
3917,Sorry to Bother You,(2018),6.9,"Comedy, Fantasy, Sci-Fi",52007,80
3918,Mowgli: Legend of the Jungle,(2018),6.5,"Adventure, Drama, Fantasy",51622,51
3919,Suspiria,(I) (2018),6.8,"Fantasy, Horror, Mystery",51034,64
3920,Fifty Shades Freed,(2018),4.5,"Drama, Romance, Thriller",49484,31

## séparation du Dataframe pour les différentes tables SQL

In [3]:
df_style = df_movie[[ 'genre']]
df_style

                           genre
0          Action, Drama, Sci-Fi
1      Action, Adventure, Comedy
2     Action, Adventure, Fantasy
3      Action, Adventure, Comedy
4     Action, Adventure, Fantasy
...                          ...
3916    Action, Biography, Drama
3917     Comedy, Fantasy, Sci-Fi
3918   Adventure, Drama, Fantasy
3919    Fantasy, Horror, Mystery
3920    Drama, Romance, Thriller

[3921 rows x 1 columns]

In [4]:
df_films = df_movie[['movie','years']]
df_films

                                        movie       years
0                                       Logan      (2017)
1                              Thor: Ragnarok      (2017)
2     Star Wars: Episode VIII - The Last Jedi      (2017)
3              Guardians of the Galaxy Vol. 2      (2017)
4                                Wonder Woman      (2017)
...                                       ...         ...
3916                              Outlaw King      (2018)
3917                      Sorry to Bother You      (2018)
3918             Mowgli: Legend of the Jungle      (2018)
3919                                 Suspiria  (I) (2018)
3920                       Fifty Shades Freed      (2018)

[3921 rows x 2 columns]

In [5]:
df_classement= df_movie[['imdb','votes','metascore']]
df_classement

      imdb   votes  metascore
0      8.1  603294         77
1      7.9  536979         74
2      7.0  527314         85
3      7.6  527257         67
4      7.4  519811         76
...    ...     ...        ...
3916   6.9   52776         59
3917   6.9   52007         80
3918   6.5   51622         51
3919   6.8   51034         64
3920   4.5   49484         31

[3921 rows x 3 columns]

In [ ]:
df_note['votes'].max()

## 2ème étape: Stockage des données dans une base SQL

insérer les données dans la table classement

In [6]:
# Connection à la database
connection = pymysql.connect(host='localhost', user='root', password='@Yunalabest974.', db='movie')

# creation cursor
cursor=connection.cursor()

# Insertion des données dans la dataFrame
for i,row in df_classement.iterrows():
    sql = "INSERT INTO classement(imdb,votes, metascore) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cursor.execute(sql, tuple(row))

    # the connection is not autocommitted by default, so we must commit to save our changes
    connection.commit()
    
connection.close()

insérer les données dans la table  style

In [7]:
# Connection à la database
connection = pymysql.connect(host='localhost', user='root', password='@Yunalabest974.', db='movie')

# creation cursor
cursor=connection.cursor()

# Insertion des données dans la dataFrame
for i,row in df_style.iterrows():
    sql = "INSERT INTO style(genre) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cursor.execute(sql, tuple(row))

    # the connection is not autocommitted by default, so we must commit to save our changes
    connection.commit()
    
connection.close()

insérer les données dans la table classement

In [8]:
# Connection à la database
connection = pymysql.connect(host='localhost', user='root', password='@Yunalabest974.', db='movie')

# creation cursor
cursor=connection.cursor()

# Insertion des données dans la dataFrame
for i,row in df_films.iterrows():
    sql = "INSERT INTO films(movie, years) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cursor.execute(sql, tuple(row))

    # the connection is not autocommitted by default, so we must commit to save our changes
    connection.commit()
    
connection.close()